In [1]:
import pandas as pd
import numpy as np

In [2]:
data = np.random.randint(10,20, (10, 5))

In [3]:
df = pd.DataFrame(data, columns=list("ABCDE"))

In [4]:
df

    A   B   C   D   E
0  16  18  19  17  10
1  11  15  16  15  19
2  14  11  18  11  14
3  12  15  16  14  15
4  13  16  17  18  17
5  10  11  19  17  14
6  18  14  19  19  15
7  14  16  11  17  17
8  14  14  11  19  19
9  13  15  15  19  12

# Locate

- import point as 5 is included below beacuse it is called based on the name

### name based list is locate

In [5]:
df.loc[:5, "A":"C"]

    A   B   C
0  16  18  19
1  11  15  16
2  14  11  18
3  12  15  16
4  13  16  17
5  10  11  19

In [6]:
df.loc[[0, 2, 5], ["C", "D", "A"]]

    C   D   A
0  19  17  16
2  18  11  14
5  19  17  10

In [7]:
df["A"]>15

0     True
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
9    False
Name: A, dtype: bool

In [8]:
df.loc[df["A"] > 15]

    A   B   C   D   E
0  16  18  19  17  10
6  18  14  19  19  15

- it's showing the true part only

In [9]:
df.loc[df["A"] > 15, [True, True, False, True, False]]

    A   B   D
0  16  18  17
6  18  14  19

- the second part is to select the particular column or not

## Index Locate

In [10]:
out = df.loc[df["A"] > 15, [True, True, False, True, False]]

In [11]:
df.iloc[[3, 5]]

    A   B   C   D   E
3  12  15  16  14  15
5  10  11  19  17  14

In [12]:
out

    A   B   D
0  16  18  17
6  18  14  19

In [13]:
out.iloc[[1, 0, 1, 0]]

    A   B   D
6  18  14  19
0  16  18  17
6  18  14  19
0  16  18  17

In [14]:
out.mean(axis=0)

A    17.0
B    16.0
D    18.0
dtype: float64

In [15]:
out.mean(axis=1)

0    17.0
6    17.0
dtype: float64

In [16]:
out.describe()

               A          B          D
count   2.000000   2.000000   2.000000
mean   17.000000  16.000000  18.000000
std     1.414214   2.828427   1.414214
min    16.000000  14.000000  17.000000
25%    16.500000  15.000000  17.500000
50%    17.000000  16.000000  18.000000
75%    17.500000  17.000000  18.500000
max    18.000000  18.000000  19.000000

In [17]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))

In [18]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [19]:
out.iloc[:2, 0] = np.nan

In [20]:
out

    A   B   D
0 NaN  18  17
6 NaN  14  19

In [21]:
df

    A   B   C   D   E
0  16  18  19  17  10
1  11  15  16  15  19
2  14  11  18  11  14
3  12  15  16  14  15
4  13  16  17  18  17
5  10  11  19  17  14
6  18  14  19  19  15
7  14  16  11  17  17
8  14  14  11  19  19
9  13  15  15  19  12

In [22]:
out

    A   B   D
0 NaN  18  17
6 NaN  14  19

In [23]:
out.isna()

      A      B      D
0  True  False  False
6  True  False  False

- out.isna() is uesd to get output as true for nan and else false
- out.dropna() for the vice-versa

In [24]:
out.dropna(axis=0)

Empty DataFrame
Columns: [A, B, D]
Index: []

In [25]:
out

    A   B   D
0 NaN  18  17
6 NaN  14  19

In [26]:
out.dropna(axis=0, thresh=3)

Empty DataFrame
Columns: [A, B, D]
Index: []

- use of thresh ???????????

- out.iloc?

In [27]:
df.iloc[:2, :2] = np.nan

In [28]:
df

      A     B   C   D   E
0   NaN   NaN  19  17  10
1   NaN   NaN  16  15  19
2  14.0  11.0  18  11  14
3  12.0  15.0  16  14  15
4  13.0  16.0  17  18  17
5  10.0  11.0  19  17  14
6  18.0  14.0  19  19  15
7  14.0  16.0  11  17  17
8  14.0  14.0  11  19  19
9  13.0  15.0  15  19  12

In [29]:
df.dropna(axis=0, thresh=4)

      A     B   C   D   E
2  14.0  11.0  18  11  14
3  12.0  15.0  16  14  15
4  13.0  16.0  17  18  17
5  10.0  11.0  19  17  14
6  18.0  14.0  19  19  15
7  14.0  16.0  11  17  17
8  14.0  14.0  11  19  19
9  13.0  15.0  15  19  12

In [30]:
df.apply(print)

0     NaN
1     NaN
2    14.0
3    12.0
4    13.0
5    10.0
6    18.0
7    14.0
8    14.0
9    13.0
Name: A, dtype: float64
0     NaN
1     NaN
2    11.0
3    15.0
4    16.0
5    11.0
6    14.0
7    16.0
8    14.0
9    15.0
Name: B, dtype: float64
0    19.0
1    16.0
2    18.0
3    16.0
4    17.0
5    19.0
6    19.0
7    11.0
8    11.0
9    15.0
Name: C, dtype: float64
0    17.0
1    15.0
2    11.0
3    14.0
4    18.0
5    17.0
6    19.0
7    17.0
8    19.0
9    19.0
Name: D, dtype: float64
0    10.0
1    19.0
2    14.0
3    15.0
4    17.0
5    14.0
6    15.0
7    17.0
8    19.0
9    12.0
Name: E, dtype: float64

A    None
B    None
C    None
D    None
E    None
dtype: object

In [32]:
s = pd.Series(["Vishal", "Ayushi"])

In [33]:
s[3] = "Ishika"

In [34]:
s

0    Vishal
1    Ayushi
3    Ishika
dtype: object

In [35]:
def gen_output(row):
    row["output"] = row.sum()
    return row

In [42]:
df.apply(gen_output, axis=1)

      A     B     C     D     E  output
0   NaN   NaN  19.0  17.0  10.0    46.0
1   NaN   NaN  16.0  15.0  19.0    50.0
2  14.0  11.0  18.0  11.0  14.0    68.0
3  12.0  15.0  16.0  14.0  15.0    72.0
4  13.0  16.0  17.0  18.0  17.0    81.0
5  10.0  11.0  19.0  17.0  14.0    71.0
6  18.0  14.0  19.0  19.0  15.0    85.0
7  14.0  16.0  11.0  17.0  17.0    75.0
8  14.0  14.0  11.0  19.0  19.0    77.0
9  13.0  15.0  15.0  19.0  12.0    74.0

In [43]:
def gen_output(row):
    print(id(row))
    row["output"] = row.sum()
    print(id(row))
    return row

- id has been printed just to know the process going on background
- in the above way the change is in above series id, try to change without changing its original series

In [44]:
df.apply(gen_output, axis=1)

2004222237512
2004222237512
2004222234696
2004222234696
2004186670408
2004186670408
2004222234760
2004222234760
2004222236488
2004222236488
2004222235464
2004222235464
2004222235400
2004222235400
2004222238664
2004222238664
2004222238344
2004222238344
2004222236872
2004222236872
2004222238536
2004222238536

      A     B     C     D     E  output
0   NaN   NaN  19.0  17.0  10.0    46.0
1   NaN   NaN  16.0  15.0  19.0    50.0
2  14.0  11.0  18.0  11.0  14.0    68.0
3  12.0  15.0  16.0  14.0  15.0    72.0
4  13.0  16.0  17.0  18.0  17.0    81.0
5  10.0  11.0  19.0  17.0  14.0    71.0
6  18.0  14.0  19.0  19.0  15.0    85.0
7  14.0  16.0  11.0  17.0  17.0    75.0
8  14.0  14.0  11.0  19.0  19.0    77.0
9  13.0  15.0  15.0  19.0  12.0    74.0

In [45]:
def gen_output(row):
    temp = row.copy()
    temp["output"] = row.sum()
    return temp

In [46]:
df.apply(gen_output, axis=1)

      A     B     C     D     E  output
0   NaN   NaN  19.0  17.0  10.0    46.0
1   NaN   NaN  16.0  15.0  19.0    50.0
2  14.0  11.0  18.0  11.0  14.0    68.0
3  12.0  15.0  16.0  14.0  15.0    72.0
4  13.0  16.0  17.0  18.0  17.0    81.0
5  10.0  11.0  19.0  17.0  14.0    71.0
6  18.0  14.0  19.0  19.0  15.0    85.0
7  14.0  16.0  11.0  17.0  17.0    75.0
8  14.0  14.0  11.0  19.0  19.0    77.0
9  13.0  15.0  15.0  19.0  12.0    74.0

In [49]:
df["K"] = np.random.randint(1, 4, 10)

In [55]:
df.groupby("K").mean()

           A          B      C      D     E
K
1  13.500000  14.500000  15.25  16.25  15.0
2  14.666667  14.333333  16.20  16.80  15.6
3  10.000000  11.000000  19.00  17.00  14.0

In [56]:
df.groupby("K").median()

      A     B     C     D     E
K
1  13.5  15.5  16.0  17.5  15.5
2  14.0  14.0  16.0  17.0  15.0
3  10.0  11.0  19.0  17.0  14.0

In [57]:
data = {}
data = {'company':['Google', 'Google', 'Microsoft', 'Microsoft', 'Facebook', 'Facebook'],
       'Person': ['Ayushi', 'Vishal', 'Apeksha', 'Aaryan', 'Manish', ' Aayush'],
       'Sales': [200, 340, 120, 124, 243, 350]}

In [60]:
d1 = pd.DataFrame(data = data)
d1

     company   Person  Sales
0     Google   Ayushi    200
1     Google   Vishal    340
2  Microsoft  Apeksha    120
3  Microsoft   Aaryan    124
4   Facebook   Manish    243
5   Facebook   Aayush    350

In [62]:
byComp = d1.groupby('company')

In [64]:
byComp.count()

           Person  Sales
company
Facebook        2      2
Google          2      2
Microsoft       2      2

In [65]:
byComp.mean()

           Sales
company
Facebook   296.5
Google     270.0
Microsoft  122.0

# OR
#### to calculate those means

In [70]:
d1['company'] == "Google"

0     True
1     True
2    False
3    False
4    False
5    False
Name: company, dtype: bool

In [71]:
d1[d1['company'] == "Google"]

  company  Person  Sales
0  Google  Ayushi    200
1  Google  Vishal    340

In [74]:
d1[d1['company'] == 'Google']['Sales'].mean()

270.0

In [75]:
d1.describe()

            Sales
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000